package j09_클래스;

public class 필기 {

	public static void main(String[] args) {
		
		/*
		 *  Class란 ? ----> "틀"
		 *  객체를 찍어낼 수 있는 틀 입니다. 
		 * 	instance
		 *	class로 객체(object)를 찍어내면 그 나온 결과물(실체)를 instance라고 합니다.
		 *	class의 instance라고도 말을 합니다. 
		 * 
		 * 
		 * 메모리 -> S(스택공간) 과 H(힙 공간)으로 나뉩니다. 
		 * 힙은 남아서 놀고있는 영역으로, 필요할 때마다 빌려서 사용하게 됩니다. 
		 * 이걸 빌릴 때 사용하는 행위가 new로, '생성'하고 가져와서 사용하게 되고, 
		 * 빌렸으니 반납을 해야 하는데 그걸 '소멸'이라고 말하게 됩니다.
		 * 자바에서는 알아서 소멸해주고 ,,,,  
		 * 
		 * stack(정적) heap(동적)
		 * 
		 * 
		 * new로 생성해서 heap공간 메모리를 할당받는데, 
		 * 근데 뭐 맨날 남는자리가 다르겠죠 당연히??
		 * 고정이 아닙니다
		 * 
		 * 각자의 클래스의 인스턴스는 new로 각자 다른 공간을 할당받아서
		 * 각자 다른 변수와 메소드를 지니고 있는 것입니다. 
		 * 자기 공간 주소를 참조하여 클래스를 사용할 수 있는 것입니다. 
		 */

	}

}
